<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"26a7c040bf0bc382649cab2fb437b534d75c68d146f22bca53636116841b30b2","plan_job_ref":"Job .github/workflows/_test-tf.yaml #84 at https://github.com/DND-IT/github-workflows/actions/runs/16218948324","plan_out_hash":"fce4fbc38d5dcf35432afd8aa6668b83dcf7479279ab974b6bb048f5a4c1e1cc","plan_hash":"553ba9d3361720d3fb23cce02174e7a0ad8ffa383718c0b78aa50d62da157d04","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #84](https://github.com/DND-IT/github-workflows/actions/runs/16218948324)